{"Transcript": "Uh, thank you for calling Karen Insurance. I am Owen from the claim support team. How may I assist you today?.Hi I want to file a claim for my vehicle..I'm sure I can help you with that. Can you please provide your policy number?.Sure. Let me see..Uh, it's XYZPOL 34567..OK, thanks for the information. Uh, is the vehicle registered under your name? Yes, it is..OK, alright. Uh, for the verification purpose, can you please tell me your UH flight number or your VIN?.I don't remember the VIN, but the plane plate number is a LB AM A9 08/2..OK. Thank you for the confirmation. Could you please tell me your license number? Ohh, sorry I don't have it handy..OK, no worries. Uh, for the verification purpose again, uh, can you please share your e-mail address or phone number on file with us? Yeah sure. So the phone number is 51234 zeros and the e-mail ID is rows.smith@gmail.com..Uh, can you spell it out for me? The e-mail ID Yeah, sure. So it's R for rose, O for orange, S for sunshine, E for elephant..Dot..Uh, it's for sunshine info monkey, I for ice cream, T for tree and H for hat@gmail.com..OK. Alright. Thanks. Thank you for the information. Can you please tell me the date and time of the accident?.Umm, actually it happened today itself about 1/2 an hour ago..OK, alright. Uh, where did this happen? And you know, can you tell me how it happened?.OK, so it occurred in my office parking lot while I was driving backwards to come out of the parking place and hit another vehicle which was parked beside mine. I cut the wheel too tightly and it struck it..OK. Uh, could you be a bit more specific regarding the address? Sure. Uh, so the address is 39 B, Gray St. LA 55..Oh, OK Uh, is that your office address? Ohh, yes it is. OK, alright. Uh, what was the time of the event? I think it was around 5:00 o'clock in the evening..OK, thank you for the information. Could you please stay, uh, describe the damage? Yes uh, the left tail light of my car is completely broken and also that area of the car body is damaged on the Hatch. The bumper is also affected..OK, alright, noted. Uh, was there enough lighting in the parking lot? No, no, it was kind of dark. The parking is in the basement and the lights have not been functioning for a few days. They say it will be fixed every day, but it never works..Alright. Did you get hurt in the accident by the way? No, it was just a minor accident. Just the cars got damaged..All right. Did anyone else get hurt? No. Nobody was there. It was only me..OK, alright. Thank you for the information. Are you with your car right now?.Yes, yes. I'm at the parking lot only, but just came out of the parking spot..All right, Good to know that you are safe, ma'am. Uh is your vehicle in a condition to drive? Do you need any assistance in towing the vehicle?.Uh, no, it's alright. I can drive, but the tail light is gone, is broken. So I'm worried about the police on Rd..I understand ma'am. Uh given that the tail light is broken and not functioning, the vehicle is not considered to be safely drivable according to the law. But don't worry, I can arrange uh toe to pick it up and bring it to The Body Shop of your choosing..OK, um, can you help me locate some body shops nearby so that I can decide which shop to use?.Sure, I can help you with that. So you said your zip code is 90055, is that correct? Yes, Yes it is. That's right..OK, alright. Uh, so I'm just checking, um, based on your zip code, I can see that there are three repair shops nearby..OK..Hello, Ma'am, are you online? Yes, yes I am. Uh, do you mind sending the details over mail?.Yeah, I have just sent you the e-mail. Can you please? Ohh, yes, that's great. Thanks. Um, yeah, I'm looking at your mail now and I'd like the vehicle to be taken to Joe's auto body..OK, OK, great. I will request our UH-2 vendor to UH, pick the vehicle up. UH, someone from Roadway Towing may contact you just to confirm the location of the vehicle..And no problem. Yeah, I'll have my phone with me..OK, Alright. Uh, Mrs. Smith. Uh, there are a couple of more questions I wanted to ask and confirm. Is that OK with you? Yeah, sure, but please be quick. I only have a few minutes..Sure, ma'am. I'll be quick. Uh, so were there any witnesses of the accident or any CCTV installed in the parking lot? I guess nobody was there as it was late in the evening. But yeah, there are CCVS, but I'm not sure whether they'll work..Uh, alright. Uh, the other car you hit, Do you know the owner of the car? Was he or she informed about the accident? No, honestly, I don't know the owner, but I can tell you the make and model. I think it's a black Honda CRV..Alright, did you happen to notice the license plate of the car? And uh, can you also describe the damage of the other car?.Uh, no I didn't. I was checking my tail lights, but then the damage to the passenger side rear above the wheel..Passenger side, rear above full. OK, OK got it. Uh so alright uh, do you have any photos or any video footage of the accident scene or damage to your vehicle?.Yes, I have taken some photos of my car and I figured out you would ask, uh, where do I send that?.Ohh great. Uh OK uh so you'll be getting a confirmation e-mail after a conversation. Uh, please reply on that e-mail and attach all the photos of the damage..Uh, if you are still at the scene and if you have the ability, I would request you to please leave a note with the other vehicle owner as well with your contact information so we may expedite the claim process..Sure, sure. I'll do that..OK, alright. Uh, so there's one last question. Uh, there is a rental coverage on your policy. Are you in need of rental vehicle? No, thank you. My son is away at college and I have vehicle available to you. So while mine is being fixed..Sure, sure. Uh, thank you so much for the information. I have noted down the details and we'll file a claim for you. Uh, you'll be getting a confirmation for the same. Also, a claim adjuster will be assigned to your case and he or she will get in touch with you on your registered phone number. For any other information, I would request you to gather the bills and the receipts of your services you have or will incur and keep them handy to submit when necessary..Please reach out to us at claims@threatcare.com and mention your policy ID. Uh, we would be happy to assist you. Is there anything else I can help you with?.Uh, yes. I'd like to know what is covered under my policy and what I can claim..Uh, sure. Uh. Let me have a quick look at your policy details. Uh, please stay online. Yeah, sure..OK. I can see that your vehicle, UH LB AM A-9082 has a collision coverage, but the adjuster will review your coverage and make the determination of what is applicable and we'll be reaching out to confirm those details..Alright, thanks Sir. Please keep me posted on this. Sure ma'am..I hope I was able to clarify, uh, the questions you had. And once again, I apologize that you had to go through the accident. Please take care of yourself. We are always with you at every step and we'll make sure you have the smoothest claim process..Sure. Thank you..Anything I might assist you with? Uh, no thanks, I'm good..OK, have a good day and take care. You might be getting a text for feedback of a conversation. I encourage to rate this conversation on a scale of 1 to 10, one being extremely unhappy and 10 being extremely happy. Your feedback will help us improve the process. Thank you for contacting care Insurer. Have a nice day..Thank you. Have a nice day.."}