{"Transcript": "Thank you..For calling care insurance, you are talking to Vincent from claims request team. How may I assist you today?.Hi I want to file a claim for an accident I had..Sure, I can help you with that. For your information, this call might be recorded for quality and training purposes. May I know your policy number with us? Sure, it's PC PL-8989..OK. OK. 8989, you said the last. Yep. Yep. OK. OK. Alright. Thank you. Thank you so much. Please remain online while I check the policy details..Chuckles..Please be online, yeah..OK. All right. Am I talking to Mr. Kroski? Uh, yes..OK, thank you Sir for the for the confirmation. Uh, for verification purposes can you please also tell me your mobile number and or e-mail address on file with us sure it's uh 5550129858..Alright..Thanks for the confirmation, so please tell me what happened..So I was driving towards the east of Monroe St. and I took a left at the crossing but there was no sign indicating there was a left turn, that there was no left turn and apparently it's a one way Rd. There was a car coming from the other side and I hit the car head on, but it's not my fault, there was no sign..OK..OK, I'm so sorry to hear that, Sir. Ohh. Were you hurt in the accident? Uh yes, Uh. The airbag went off luckily, so it's that covered my face. But I'm still. I still managed to hurt my right leg and my right arm, and there's some bruises on my shoulder as well..Ohh, that sounds really bad. Uh, did you get any medical treatment for the injury?.Yes, the the medic was there and they gave me first aid, but I need to visit the hospital to get it checked as well..OK. OK. I'm so sorry to hear that, Sir. Did an ambulance come to the?.Seen Do you recall who called the ambulance? I think some pedestrians called..Ohh okay okay. Was there anyone else with you inside the car? No, no, I was the only one driving..OK, alright. Uh, can you confirm which vehicle on your, on your policy you were driving? Yeah, sure, it was the 2020 Honda CRV..Ohh OK, OK..Again, once again, I'm so sorry to hear that you had an accident. Uh, could you please confirm the street name where you took the left turn?.I think it was Union Street..All right, uh, so while taking a left turn towards Union Street from Monroe St. you had a head on collision with another car coming from the opposite direction. Is that an accurate description of the event? Exactly. That's about it. But there was also no sign at the crossing..Ohh, yes. Yeah..Sure, I have noted that down. Uh, can you please tell me the date and time uh, this happened?.Uh, it happened on Saturday, May 6th..Alright, and what was the approx time when it happened around 4:00 PM in the evening?.Yeah, alright, so can you please describe in detail the damage that happened to your car? Yeah yeah so my friend. Bumper is totaled and it fell off. My airbags went off and it's a complete mess. The engine took a bad hit I guess uh the the the car just wouldn't start anymore..OK, alright. Uh, what about the other card?.There was the driver or any other person injured. Yes, yes, yes. The driver was a female and she got hurt badly. Apparently her airbag didn't go off I guess, but I think she was wearing a seat belt..OK, OK..So can you describe the level of injury she might have sustained? Yeah, yeah, yeah. I I think she hit her head on the wheel. There was a lot of blood. She was unconscious, but there was a little girl in the back seat as well. Uh, luckily she wasn't hurt, though I am terrified to imagine what would have happened if she was injured..Yeah, it's pretty bad. Uh, do you know if, if the driver was taken to the hospital? To the hospital. Yes, yes, Yes, Yes, yes. I think they took her to the Baptist Medical Center..OK. OK. All right..I can understand, Sir. Uh, so really sorry again that you had to go through this. Uh, was anyone else injured? Registration or any passenger?.Uh, I I I don't think so. Uh, there was not much traffic at that time..Alright. Uh, do you know uh the?.License plate number of the other vehicle? Uh, yes. Yes, it was um MO G..567 Sup..OK, alright. Can you please describe?.The damage to the other car as well. This will actually help us accurately assess the liability in the incident and allow us to..Pursue any recovery from their insurance, if applicable..Uh, yeah, yeah, yeah. I think the damage is pretty similar to mine. Uh, the front window was shattered..Oh, OK All right. So did any police report?.To the scene after the accident occurred, yes, yes, The police came and there was a a report filed as well, Yeah..OK, OK. All right. Do you have?.Have the report number. Unfortunately I don't, I'm sorry..Alright, uh, please, if you can, try to obtain that so that you know we can request the accidental..Information from the police as well whether any witness that saw the accident..I don't know. I haven't asked, but there were some people that the police were asking questions. Um, you can check in with the police, you know?.OK. We will do that. Thank you. Uh, where is your vehicle now?.Did you call for a tow service? Uh, yeah, yeah, I had to like it was pretty bad and the engine wouldn't start right. So I called the roadway tow services and they have picked up my car to the repair shop..OK, alright. Uh, thank you for the info..Permission. Do you have the receipt of the tour services? Yes. Yes I do. Yeah..Ohh great. Uh please keep it safe..We will need to review it for any, you know, potential reimbursement. Can you please share the name of the repair shop? Yeah, yeah, yeah, it was. It's that Ali's Garage at Rexford Rd..OK. All right..So based on the facts of the accident and the damages to your vehicle, there is a high likelihood your vehicle is a total loss. OK, so based on this information, we can arrange with our printer to pick up your vehicle from Aldi's garage and bring it to one of..For storage facilities where it will not be subject to storage fees..Uh, The Body Shop will charge..Uh, if you agree then please uh contact The Body Shop and let them know we will be picking up the vehicle within two business days and provide them with permission to release the vehicle to our vendor. I would..Also request you to please remove any personal belongings from the car, including license plates and any other personal things. I would also recommend looking through your records to relocate or to locate..The title of the vehicle and any lienholder information as that documentation will be necessary for the processing of the total vehicle. Yeah, yeah, yeah, yeah, yeah, sure, sure. I'll, I'll work on making that call and gathering all the documentation. Thank you..OK, thank you. Uh. Since your vehicle is not drivable and you do have a rental coverage on your policy, are you in need of a rental vehicle? I mean, I'll need one in a few days, but my friend is picking me up right now and he's taking me to the UH, so it's not necessary just yet..Uh sorry Sir. Where is he taking you? He's taking me to the ER like I have to visit the hospital. Ohk OK OK alright. Yeah, yeah sure..Sure. OK. Thank you so much for the information. I have noted down the details and we'll submit this claim for you. You'll be getting a confirmation..And with your claim details, a claim adjuster will also be assigned to your case and he or she will get in touch with you on your mobile number within one business day..Or any other information. I would request you to gather the bills and receipts of the services you have or will have, and keep them handy to submit when necessary. Your adjuster will be able to assist you with your Internet reservation. When you're ready, please reach out to us at claims@career.com..And mention your policy ID..We would be happy to assist you. Is there anything else I can help you with, Mr. Grosky? Yes, thank you. Thank you. How long will this claim take to process?.Uh, sure. So the time it takes to process a claim can vary depending on..On the complexity of the claim and the extent of the damage, our adjuster will be able to provide you a better estimate of the timeline once they have assessed the damage to your vehicle..It's a short that we will do everything we can to process your claim as quickly as possible..OK. So when I get any update on that claim process?.Uh, yes Sir. You will get regular updates on the process over text and e-mail. OK, that's amazing. Thank you. Please keep me posted..Absolutely..So I hope I was able to clarify any questions. And once again, I apologize that you had to go through the accident. Please take care of yourself and get your injuries treated. We are always with you at every step and we'll make sure you have a smooth claim process. Sure, sure. Thank you. Thank you very much..Anything else I might assist you with? No, no, not really no..OK, you have a good day and take care. You might be getting a text uh for feedback of our conversation. I encourage to rate this conversation on a scale of 1 to 10, one being extremely unhappy and in..Being extremely happy, your feedback will help us improve the process. Thank you for contacting Care Insurer. Have a good day. Thank you. You too. Have a good day."}