{"transcript": "Hello..Good morning. Thank you for calling Oxford Insurance. You're talking to Razia from claim support team. How may I assist you today?.Uh hey hey uh I I had an accident with my car and I want to file a claim. Uh can you please help me with that? Sure. In order to file a claim, I'll need some more information from you. Can you please provide me with your full name and phone number?.Uh yes, it's sure. Uh my name is Isaac Marani and uh my phone number is UH 55500221212..Thank you, Sir. Can you please also tell me your policy number associated with us?.Uh, yes, sure. Uh, one moment..Uh my my policy number is uh PCQ uh 987654 M..Thank you, Mr. Omrani, please be on line while I check your details..OK..I see you have three cars registered in this policy. Can you please specify the registration number of the vehicle you want to raise a claim for?.Uh, yes, yes, sure. Uh, so the registration number is UH Vic, UH 26708..Uh, it's uh, Toyota Camry. Thank you. Do you know the manufacturer of the vehicle?.I guess it is uh 2018 18 model I I believe..OK. Thank you for the confirmation. Can you please tell me now what happened, Sir?.Yes. So my car was parked outside my home and some idiot hit, hit, hit my car and ran away..Ohh, I'm so sorry to hear that Sir. Can you please tell me a bit more detail? Uh like when did this happen?.Yes, it it happened yesterday night at around 022 AM..Alright, so that is 17th May, 2:00 AM in the morning outside your house, is that correct? Yes, that is right. Can you please confirm your home address for the record?.Uh, my current address is UH 3 Elm St. UH Colorado 81019 UH this is my new house..Yes. Is this the address mentioned in your policy? Uh, no, no, no. This is this is my new house, Uh, when I took the policy last year, I stayed at a different address. Do you, do you want that address? I'm sure it will be helpful if you could confirm that please..Uh OK uh, it was uh 198 UH Bandura St. Colorado 810-0882 should be on your file..Thank you for the confirmation, Sir. Uh, when did you notice that your car was hit?.Ohh I I I was sleeping and as soon as the car was hit the security alarm went off. I was awake, I went outside and I saw the indicators were on and so there was a very loud noise..Alright, got it. I'm really sorry to hear that, Sir. When did you install the security system? Did it come with the car when you bought it?.Uh, yes, it it came with the car only..Thank you for clarifying. Can you please tell me a little about the damage to your car? Which parts were damaged?.Uh OK uh so the left side driver door was uh completely damaged. Uh it went it went inside the seat. The driver seat was also damaged. The front bumper fell off..Uh it was uh hit so hard that the the tire is also bent. This is this is my favorite car. Uh this sporting little not a lot of repair..Ohh, that looks like pretty damaged. I am so sorry for your loss Sir. But don't worry we will definitely try to help you in your claims process. I just need to know a few more details before I can go ahead and file the claim..Ah, yes, yes, please go ahead. Sure. Did you happen to notice the other car that hit you, where you may be able to get their license plate number or the model of the car?.Uh, how can I notice that I was asleep? I told you right? And so that's moron. Ran away after hitting my car and I did not see anyone..Alright, Sir, I can understand that'll be frustrating. Do you know if any of your neighbors had noticed that card?.I asked it uh a few of my neighbors. Uh, nobody was awake. Uh, I don't think anyone noticed. Alright. And do you have any CCTV installed at your house?.Uh yes I do. I have two cameras installed. Uh, one facing the lawn and the other one is at the backyard. OK, that's great. Have you checked checked the footage from last night?.Yes I have checked but the camera angle is is not good and covers only the lawn and the front door..OK. And where was your car parked? Was it on the driveway or on the main road outside your house?.Uh, it was on the road. Uh, in this house. I don't have driveway. This is new house UH Everyone parks their car on the road in the neighborhood..I see. So your CCTV doesn't cover your car parking?.No, but I think I need a I need a new CCTV now and point at my parking now..And yeah, that would be helpful in the future, but do you know if any of your neighbors have any CCTV installed?.Uh, yeah. Yes. Good. I think it's good that you mentioned, I think, uh, the Sullivans have the CCTV's. I can check with them. They must have captured what happened last night. Yes. Good. Good..Ohh, that's wonderful Sir. I would request you to kindly check with them and let us know whether they can provide us with the footage from last night. It would, you know, help us extremely in terms of expediting your claims process..OK. I can do that, yeah..All right. And do you know if anyone was injured in the event?.I don't think so. It was, uh, very late night. Uh. I doubt anyone was outside during that time. Uh, it is, uh, quite. It is a quiet neighborhood. OK, And did you file a police report?.Uh, yes. I did it yesterday night only after the accident..OK, uh, that's great. Can you please share the police report number if you have it handy? It'll help us in coordinating with the department and we can collect the necessary information that is required for the underwriter, for the adjusters..OK. OK. Yeah, Yeah, sure, sure. One moment, please. Yeah..Uh, so it is uh 20220517..805158 R C9 Alright noted. Can you please tell me how the weather was last night? Did it rain?.I I don't think it rained last night, uh, at this time of the year, I don't expect as well..And how's the lighting in your neighborhood? Do you have enough lights on the road during night?.Uh, yes, I I think there are would light. The road is well lit during night time..Ohh great thank you for your information. I have noted down the details and going by your description I think your car sustained severe damages and I'm assuming that it is not in a drivable condition now. So do you need any help in finding out repair shop near your area?.Yes, that will be that will be great if you can arrange one for me. Uh, I see I am new to this area. OK and I haven't explored much so yes very needed. Sure Sir please be online and let me check if there is any Body Shop partner in your area..OK..Alright, I see there are four body shops within 5 kilometer radius in your zip code, but Monique's Body Shop is the closest one. I can also arrange a tow service to get your car to The Body Shop. Should I go ahead and book the tow service?.Uh yes please. That will be really helpful. Alright, I have booked the service. You will be getting a call on your registered number from roadway to services within half an hour and I will also inform the Moniques Body Shop about your cars arrival. You will also get a call from them in some time. I will advise you to keep the service and repair related bills with you. You will need to submit them during the claims process. And apart from that do you need any rental service as well while your car is being repaired?.Uh, no, I don't. I think that's OK. Uh, I will have my brother adopt his car at my place for the time being..OK, OK. OK. Sure. Sir, if uh, is there anything else I may help you with?.Uh, yes. So what is the next step for me? OK, so the tow service will coordinate with you to get your car picked up and here I will initiate the claim on this system now and you will receive a confirmation of your registered e-mail and phone number. Then a claim adjuster will be assigned to your case and they will get in touch with you on your mobile number within one business day. If they want to ask you any other information, I would request you to gather the bills and receipts of the services..You have had or you will have and keep them handy to submit whenever necessary..Is there anything else that I may help you with?.Uh, no, I think. I think that is all. I will wait for the two services. Yeah. And uh, thank you very much. You have been very helpful today. God bless you..Thank you so much Sir. I'm really sorry you had to go through this accident. It must have been really difficult since this is your favorite car..Yeah, it is. It is a tough day. I know. It happens. It's OK. Sure. I hope I was able to clarify any questions. And once again, I apologize that you had to go through the accident. So please take care of yourself and reach out to us at claims@oxford.com and do mention your policy ID. We would be happy to assist you..You might be getting a text for feedback for our conversation. I encourage you to rate this conversation on a scale of 1 to 10, one being extremely unhappy, to 10 being extremely happy. Your feedback will help us improve the process. Thank you for contacting Oxford Insurance. Have a great day..You too. You too. Have a good day. Bye..Bye.."}